In [7]:
import pandas as pd

# Creating a DataFrame from a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 70000]
}
df = pd.DataFrame(data)
print(df)

# Creating a DataFrame from a list of lists
df_list = pd.DataFrame([[1, 'Alice', 25], [2, 'Bob', 30], [3, 'Charlie', 35]], 
                        columns=['ID', 'Name', 'Age'])
print(df_list)

# Creating a DataFrame from a numpy array
import numpy as np
array = np.random.rand(3, 3)
df_array = pd.DataFrame(array, columns=['A', 'B', 'C'])
print(df_array)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
          A         B         C
0  0.302687  0.598019  0.898748
1  0.377448  0.090654  0.509706
2  0.770309  0.340742  0.308947

In [3]:
type(df)

pandas.core.frame.DataFrame

In [13]:
print(df.iloc[1, 2])

60000

In [21]:
df['Department'] = ['HR', 'IT','vinay']  # Add a new column

In [23]:
df

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000         IT
2  Charlie   35   70000      vinay

In [25]:
df.loc[len(df)] = ['David', 88, 8457, 'vinay']

df

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000         IT
2  Charlie   35   70000      vinay
3    David   88    8457      vinay

In [31]:


# Creating a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Maths': [85, 90, 95],
    'Science': [80, 85, 90],
    'English': [75, 80, 85]
}
df = pd.DataFrame(data, index=['S1', 'S2', 'S3'])  # Setting custom row index
print("Original DataFrame:\n", df)

# Column-wise operation (Calculating average score per subject)
df['Average'] = df[['Maths', 'Science', 'English']].mean(axis=1)
print("\nDataFrame after column-wise operation (row-wise mean):\n", df)

# Row-wise operation (Calculating total score per student)
df.loc['Total'] = df.iloc[:, 1:].sum()  # Summing up all subject columns
print("\nDataFrame after row-wise operation (column-wise sum):\n", df)

Original DataFrame:
        Name  Maths  Science  English
S1    Alice     85       80       75
S2      Bob     90       85       80
S3  Charlie     95       90       85

DataFrame after column-wise operation (row-wise mean):
        Name  Maths  Science  English  Average
S1    Alice     85       80       75     80.0
S2      Bob     90       85       80     85.0
S3  Charlie     95       90       85     90.0

DataFrame after row-wise operation (column-wise sum):
           Name  Maths  Science  English  Average
S1       Alice   85.0     80.0     75.0     80.0
S2         Bob   90.0     85.0     80.0     85.0
S3     Charlie   95.0     90.0     85.0     90.0
Total      NaN  270.0    255.0    240.0    255.0